{"_name_or_path": "multinerd1_model", "architectures": ["BertForTokenClassification"], "attention_probs_dropout_prob": 0.1, "classifier_dropout": null, "gradient_checkpointing": false, "hidden_act": "gelu", "hidden_dropout_prob": 0.1, "hidden_size": 768, "id2label": {"0": "O", "1": "B-PER", "2": "I-PER", "3": "B-LOC", "4": "I-LOC", "5": "B-ORG", "6": "I-ORG", "7": "B-ANIM", "8": "I-ANIM", "9": "B-BIO", "10": "I-BIO", "11": "B-CEL", "12": "I-CEL", "13": "B-DIS", "14": "I-DIS", "15": "B-EVE", "16": "I-EVE", "17": "B-FOOD", "18": "I-FOOD", "19": "B-INST", "20": "I-INST", "21": "B-MEDIA", "22": "I-MEDIA", "23": "B-PLANT", "24": "I-PLANT", "25": "B-MYTH", "26": "I-MYTH", "27": "B-TIME", "28": "I-TIME", "29": "B-VEHI", "30": "I-VEHI", "31": "B-SUPER", "32": "I-SUPER", "33": "B-PHY", "34": "I-PHY"}, "initializer_range": 0.02, "intermediate_size": 3072, "label2id": {"O": "0", "B-PER": "1", "I-PER": "2", "B-LOC": "3", "I-LOC": "4", "B-ORG": "5", "I-ORG": "6", "B-ANIM": "7", "I-ANIM": "8", "B-BIO": "9", "I-BIO": "10", "B-CEL": "11", "I-CEL": "12", "B-DIS": "13", "I-DIS": "14", "B-EVE": "15", "I-EVE": "16", "B-FOOD": "17", "I-FOOD": "18", "B-INST": "19", "I-INST": "20", "B-MEDIA": "21", "I-MEDIA": "22", "B-PLANT": "23", "I-PLANT": "24", "B-MYTH": "25", "I-MYTH": "26", "B-TIME": "27", "I-TIME": "28", "B-VEHI": "29", "I-VEHI": "30", "B-SUPER": "31", "I-SUPER": "32", "B-PHY": "33", "I-PHY": "34"}, "layer_norm_eps": 1e-12, "max_position_embeddings": 512, "model_type": "bert", "num_attention_heads": 12, "num_hidden_layers": 12, "pad_token_id": 0, "position_embedding_type": "absolute", "torch_dtype": "float32", "transformers_version": "4.34.1", "type_vocab_size": 2, "use_cache": true, "vocab_size": 30522}